[
	{
		"id": "1",
		"title": "Booki",
		"description": "Booki est une start-up qui souhaite développer un site Internet qui permette aux usagers de trouver des hébergements et des activités dans la ville de leur choix",
		"statut": "Développeur web en alternance",
        "missions": "Réalisation de l'interface du site avec du code HTML et CSS.",
        "difficultes": "Redimensionnement des images, bien déterminer les <div> parents et enfants.",
		"competences": [
			"Installer un environnement de développement front-end",
			"Utilisation de GitHub et savoir versionner un projet avec git et GitHub",
			"Implémenter une interface responsive en HTML et CSS",
			"Intégrer du contenu conformément à une maquette HTML et CSS"
		],
		"lien": "https://chalbt.github.io/PROJET_2/"
	},

    {
		"id": "2",
		"title": "Portfolio de l'architecte Sophie Bluel",
		"description": "L’agence ArchiWebos est en charge de la conception du site portfolio de Sophie Bluel, architecte d’intérieur.",
		"statut": "Développeur front-end en renfort dans une équipe de l’agence.",
        "missions": "Développer la page de présentation des travaux de l’architecte, la page de connexion de l’administrateur du site et la modale permettant d’uploader de nouveaux médias.",
        "difficultes": "",
		"competences": [
			"Manipuler les éléments du DOM avec Javascript",
			"Récupérer les données utilisateurs dans le Javascript via des formulaires",
			"Gérer les évènements utilisateurs avec Javascript"
		],
		"lien": "https://github.com/Chalbt/Portfolio-architecte-sophie-bluel.git"
	},

    {
		"id": "3",
		"title": "Site de la photographe Nina Carducci",
		"description": "L’un de mes services est de proposer l’optimisation SEO à de nouveaux clients. Nina Carducci est une photographe qui fait partie de mes prospects.",
		"statut": "Développeur freelance",
        "missions": "Développer la page de présentation des travaux de l’architecte, la page de connexion de l’administrateur du site et la modale permettant d’uploader de nouveaux médias.",
        "difficultes": "",
		"competences": [
			"Optimiser les performances et le référencement d’un site web",
			"Rédiger un cahier de recette pour tester un site"
		],
		"lien": "https://chalbt.github.io/nina-carducci.github.io/"
	},

    {
		"id": "4",
		"title": "Kasa",
		"description": "Kasa fait partie des leaders de la location d’appartements entre particuliers en France. Une refonte totale pour passer à une stack complète en JavaScript avec NodeJS côté back-end, et React côté front-end est lancée.",
		"statut": "Développeur front-end en freelance",
        "missions": "Démarrer le projet React et développer l’ensemble de l’application ainsi que les composants et les routes, en suivant la maquette fournie.",
        "difficultes": "",
		"competences": [
            "Initialiser une application avec React App",
            "Configurer la navigation entre les pages de l’application avec React Router",
            "Développer les éléments de l’interface d’un site web grâce aux composants React"
		],
		"lien": ""
	},

    {
		"id": "5",
		"title": "Mon Vieux Grimoire",
		"description": "Le Vieux Grimoire est une petite chaîne de librairies située à Lille qui souhaite ouvrir un site de référencement et de notation de livre.",
		"statut": "Développeur back-end en freelance",
        "missions": "Travailler avec un développeur front-end en mutualisant nos compétences sur un nouveau projet Mon Vieux Grimoire. Pour cela, je suis en charge du développent de toute la partie back-end.",
		"difficultes" : "",
        "competences": [
			"Implémenter un modele logique de données conformément à la réglementation",
            "Stocker des données et mettre en oeuvre des opérations CRUD de manière sécurisée"
		],
		"lien": "https://github.com/Chalbt/PROJET-7-Grimmoire.git"
	}

]